ErpTest/src/Catalogs/уатПараметрыВыработки/уатПараметрыВыработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>уатПараметрыВыработки</name>
  <comment>(уат)</comment>
  <predefined>
    <items>
      <name>ВесГруза</name>
      <description>Вес груза</description>
    </items>
    <items>
      <name>ВремяВНаряде</name>
      <description>Время в наряде</description>
    </items>
    <items>
      <name>ВремяВПростое</name>
      <description>Время в простое</description>
    </items>
    <items>
      <name>ВремяВПростоеСВклДвигателем</name>
      <description>Время в простое с вкл двигателем</description>
    </items>
    <items>
      <name>ВремяВРаботе</name>
      <description>Время в работе</description>
    </items>
    <items>
      <name>ВремяВРаботеПоДаннымGPS</name>
      <description>Время в работе по данным GPS</description>
    </items>
    <items>
      <name>ВремяВРемонте</name>
      <description>Время в ремонте</description>
    </items>
    <items>
      <name>ВремяДневное</name>
      <description>Время дневное</description>
    </items>
    <items>
      <name>ВремяНочное</name>
      <description>Время ночное</description>
    </items>
    <items>
      <name>ВремяПраздничное</name>
      <description>Время праздничное</description>
    </items>
    <items>
      <name>ВремяСпециальнойРаботы</name>
      <description>Время специальной работы</description>
    </items>
    <items>
      <name>КоличествоДней</name>
      <description>Количество дней</description>
    </items>
    <items>
      <name>КоличествоЕздок</name>
      <description>Количество ездок</description>
    </items>
    <items>
      <name>КоличествоОпераций</name>
      <description>Количество операций</description>
    </items>
    <items>
      <name>КоличествоПассажиров</name>
      <description>Количество пассажиров</description>
    </items>
    <items>
      <name>КоличествоРейсов</name>
      <description>Количество рейсов</description>
    </items>
    <items>
      <name>КоличествоТС</name>
      <description>Количество ТС</description>
    </items>
    <items>
      <name>ОбъемКм</name>
      <description>м3 км</description>
    </items>
    <items>
      <name>Объем</name>
      <description>Объем груза</description>
    </items>
    <items>
      <name>ПогрузочноРазгрузочныеРаботы</name>
      <description>Погрузочно разгрузочные работы</description>
    </items>
    <items>
      <name>Подача</name>
      <description>Подача</description>
    </items>
    <items>
      <name>ПробегНаБуксире</name>
      <description>Пробег на буксире</description>
    </items>
    <items>
      <name>ПробегОбщий</name>
      <description>Пробег общий</description>
    </items>
    <items>
      <name>ПробегОбщийПоДаннымGPS</name>
      <description>Пробег общий по данным GPS</description>
    </items>
    <items>
      <name>ПробегПорожний</name>
      <description>Пробег порожний</description>
    </items>
    <items>
      <name>ПробегСГрузом</name>
      <description>Пробег с грузом</description>
    </items>
    <items>
      <name>ПробегСПассажирами</name>
      <description>Пробег с пассажирами</description>
    </items>
    <items>
      <name>ПробегСпециальнойРаботы</name>
      <description>Пробег специальной работы</description>
    </items>
    <items>
      <name>ПробегСпециальнойРаботы2</name>
      <description>Пробег специальной работы 2</description>
    </items>
    <items>
      <name>ПробегСпециальнойРаботы3</name>
      <description>Пробег специальной работы 3</description>
    </items>
    <items>
      <name>ПробегСпециальнойРаботы4</name>
      <description>Пробег специальной работы 4</description>
    </items>
    <items>
      <name>ПробегСпециальнойРаботы5</name>
      <description>Пробег специальной работы 5</description>
    </items>
    <items>
      <name>ПростойПодПогрузкой</name>
      <description>Простой под погрузкой</description>
    </items>
    <items>
      <name>ПростойПодРазгрузкой</name>
      <description>Простой под разгрузкой</description>
    </items>
    <items>
      <name>ТнКм</name>
      <description>Тн км</description>
    </items>
  </predefined>
  <attributes>
    <name>АлгоритмРасчетаПараметра</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетНаТС</name>
    <comment>Действует на ТС</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетНаСотрудников</name>
    <comment>Действует на сотрудников</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьВТарифахНаУслуги</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПриПланировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляДокументов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Временный</name>
    <comment>Признак того, что параметр временной</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаПараметровВыработки</name>
    <type>
      <types>EnumRef.уатСпособРасчетаПараметровВыработки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательНаработки</name>
    <type>
      <types>CatalogRef.ПоказателиНаработки</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаПоНомеруЭтапа</name>
    <comment>0 - суммировать значения, 1 - выбирать максимальное значение</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ErpTest/src/Enums/уатСпособРасчетаПараметровВыработки/уатСпособРасчетаПараметровВыработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатСпособРасчетаПараметровВыработки</name>
  <enumValues>
    <name>НеРассчитывать</name>
  </enumValues>
  <enumValues>
    <name>ПоШапке</name>
  </enumValues>
  <enumValues>
    <name>ПоЗаданию</name>
  </enumValues>
  <enumValues>
    <name>ПоТТД</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Catalogs/уатПараметрыВыработки/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	об = РеквизитФормыВЗначение("Объект");
	//уатЗащищенныеФункцииСервер.уатСправочникФормаЭлементаПриСозданииНаСервере(Об, Отказ, СтандартнаяОбработка, ЭтаФорма, ДопПараметрыОткрытие);
	ЗначениеВРеквизитФормы(Об,"Объект");
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	Если Не Отказ Тогда 
		Если Параметры.Ключ.Пустая() Тогда 
			Объект.СпособРасчетаПараметровВыработки = Перечисления.уатСпособРасчетаПараметровВыработки.НеРассчитывать;
		Иначе 
			Если Объект.Предопределенный Тогда 
				Элементы.ГруппаСпособРасчетаПараметровВыработки.Видимость = Ложь;
				Элементы.АлгоритмРасчетаПараметра.Видимость = Ложь;
			КонецЕсли;
		КонецЕсли;
		
		мСпособРасчетаПараметраВыработки = Неопределено;
	КонецЕсли;
	
	// УправлениеПредприятием.СлужебныеПодсистемы
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	// Конец УправлениеПредприятием.СлужебныеПодсистемы
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//уатЗащищенныеФункцииКлиент.уатСправочникФормаЭлементаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	УправлениеВидимостью();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(Объект.СпособРасчетаПараметровВыработки) 
		И Не Объект.СпособРасчетаПараметровВыработки = ПредопределенноеЗначение("Перечисление.уатСпособРасчетаПараметровВыработки.НеРассчитывать")
		И Не ЗначениеЗаполнено(Объект.АлгоритмРасчетаПараметра) Тогда
			ТекстОшибки = "Формула расчета параметра выработки пустая! Необходимо указать формулу.";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,"Объект.АлгоритмРасчетаПараметра",,Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДействуетНаТСПриИзменении(Элемент)
	
	УправлениеВидимостью();
	
КонецПроцедуры

&НаКлиенте
Процедура ДействуетНаСотрудниковПриИзменении(Элемент)
	
	УправлениеВидимостью();
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Если ПустаяСтрока(Объект.НаименованиеДляДокументов) Тогда
		Объект.НаименованиеДляДокументов = Объект.Наименование;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьФормулуНажатие(Элемент)
	
	ФормаКонструктора = ПолучитьФорму("ОбщаяФорма.уатКонструкторФормул",, Элементы.АлгоритмРасчетаПараметра);
	
	ФормаКонструктора.ЗначениеИсточника = Объект.АлгоритмРасчетаПараметра;
	ФормаКонструктора.Заголовок = ФормаКонструктора.Заголовок + " (" + Объект.СпособРасчетаПараметровВыработки + ")";
	ФормаКонструктора.СпособРасчетаПараметровВыработки = Объект.СпособРасчетаПараметровВыработки;
	
	Результат = ФормаКонструктора.ОткрытьМодально();
	Если Не Результат = Неопределено Тогда
		Объект.АлгоритмРасчетаПараметра = Результат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СпособРасчетаПараметровВыработкиОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Объект.СпособРасчетаПараметровВыработки = ПредопределенноеЗначение("Перечисление.уатСпособРасчетаПараметровВыработки.НеРассчитывать");
	Объект.АлгоритмРасчетаПараметра = "";
	
	УправлениеВидимостью();
	
КонецПроцедуры

&НаКлиенте
Процедура СпособРасчетаПараметровВыработкиПриИзменении(Элемент)
	
	Если Не мСпособРасчетаПараметраВыработки = Объект.СпособРасчетаПараметровВыработки Тогда
		Объект.АлгоритмРасчетаПараметра = "";
		УправлениеВидимостью();
	КонецЕсли;
	мСпособРасчетаПараметраВыработки = Объект.СпособРасчетаПараметровВыработки;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// УправлениеПредприятием.СлужебныеПодсистемы
&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
КонецПроцедуры
// Конец УправлениеПредприятием.СлужебныеПодсистемы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УправлениеВидимостью()
	
	Элементы.ИспользоватьВТарифахНаУслуги.Доступность = Объект.ДействуетНаТС;
	Элементы.СпособРасчетаПараметровВыработки.Доступность = (Объект.ДействуетНаСотрудников ИЛИ Объект.ДействуетНаТС);
	
	Если Объект.СпособРасчетаПараметровВыработки = ПредопределенноеЗначение("Перечисление.уатСпособРасчетаПараметровВыработки.НеРассчитывать") Тогда 
		Элементы.РедактироватьФормулу.Доступность     = Ложь;
		Элементы.АлгоритмРасчетаПараметра.Доступность = Ложь;
	Иначе 
		Элементы.РедактироватьФормулу.Доступность     = Истина;
		Элементы.АлгоритмРасчетаПараметра.Доступность = Истина;
	КонецЕсли;
	
	Если НЕ Объект.Предопределенный
		ИЛИ Объект.Ссылка = ПредопределенноеЗначение("Справочник.уатПараметрыВыработки.КоличествоЕздок")
		ИЛИ Объект.Ссылка = ПредопределенноеЗначение("Справочник.уатПараметрыВыработки.ВесГруза")
		ИЛИ Объект.Ссылка = ПредопределенноеЗначение("Справочник.уатПараметрыВыработки.Объем") Тогда
		Элементы.ГруппаСпособРасчетаПоНомеруЭтапа.Видимость = (Объект.ДействуетНаСотрудников ИЛИ Объект.ДействуетНаТС);
	Иначе
		Элементы.ГруппаСпособРасчетаПоНомеруЭтапа.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
